In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    'name':['Anubhav','Digant','Deep','Ayush'],
    'marks':[100,99,98,97],
    'city':['Vadodara','Agra','Gandhinagar','Nainital']
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

      name  marks         city
0  Anubhav    100     Vadodara
1   Digant     99         Agra
2     Deep     98  Gandhinagar
3    Ayush     97     Nainital

In [5]:
df.to_csv('friends.csv')

In [6]:
df.to_csv('friends_noIndex.csv', index = False)

In [7]:
df.head(2)

      name  marks      city
0  Anubhav    100  Vadodara
1   Digant     99      Agra

In [8]:
df.tail(2)

    name  marks         city
2   Deep     98  Gandhinagar
3  Ayush     97     Nainital

In [9]:
df.head()

      name  marks         city
0  Anubhav    100     Vadodara
1   Digant     99         Agra
2     Deep     98  Gandhinagar
3    Ayush     97     Nainital

In [10]:
df.tail()

      name  marks         city
0  Anubhav    100     Vadodara
1   Digant     99         Agra
2     Deep     98  Gandhinagar
3    Ayush     97     Nainital

In [11]:
df.describe()

            marks
count    4.000000
mean    98.500000
std      1.290994
min     97.000000
25%     97.750000
50%     98.500000
75%     99.250000
max    100.000000

In [12]:
train = pd.read_csv('train.csv')

In [13]:
train

   Train No  Speed    City
0    124342     76    Agra
1    123245    100     Goa
2    234233     59  Mumbai
3    234345     97   Delhi

> Let's change value of Speed at index 1

In [14]:
train['Speed']

0     76
1    100
2     59
3     97
Name: Speed, dtype: int64

In [15]:
train['Speed'][1] = 100

c:\users\anubhav\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [16]:
train

   Train No  Speed    City
0    124342     76    Agra
1    123245    100     Goa
2    234233     59  Mumbai
3    234345     97   Delhi

In [17]:
train.to_csv('train.csv', index = False)

> value of speed changed in CSV as well

> We can change the names of index as well, we can use strings instead of 0,1,2,3 etc.

In [18]:
train.index = ['first','second','third','fourth']

In [19]:
train

        Train No  Speed    City
first     124342     76    Agra
second    123245    100     Goa
third     234233     59  Mumbai
fourth    234345     97   Delhi

> Names of Indices changed

In [20]:
type(df)

pandas.core.frame.DataFrame

In [21]:
type(df['city'])

pandas.core.series.Series

In [22]:
ser = pd.Series(np.random.rand(34))

In [23]:
ser

0     0.684209
1     0.077791
2     0.303986
3     0.864675
4     0.014975
5     0.625712
6     0.774893
7     0.852304
8     0.516647
9     0.143040
10    0.281682
11    0.016228
12    0.810670
13    0.723798
14    0.605804
15    0.707036
16    0.949335
17    0.698978
18    0.246700
19    0.919744
20    0.804445
21    0.578908
22    0.182586
23    0.675066
24    0.090151
25    0.795296
26    0.394320
27    0.334186
28    0.824293
29    0.512520
30    0.408998
31    0.191350
32    0.166266
33    0.384600
dtype: float64

In [24]:
type(ser)

pandas.core.series.Series

In [25]:
newdf = pd.DataFrame(np.random.rand(334,5), index=np.arange(334))

In [26]:
newdf

            0         1         2         3         4
0    0.876651  0.023991  0.870858  0.883872  0.537615
1    0.038192  0.757935  0.972538  0.908219  0.103995
2    0.844320  0.977541  0.313910  0.260622  0.055719
3    0.031624  0.788292  0.867700  0.934255  0.188155
4    0.392869  0.915014  0.249113  0.094444  0.489834
..        ...       ...       ...       ...       ...
329  0.168580  0.828024  0.146612  0.539410  0.635924
330  0.581546  0.044798  0.336545  0.332303  0.411665
331  0.029285  0.808006  0.496062  0.968157  0.854302
332  0.753757  0.565037  0.148044  0.333649  0.987141
333  0.972523  0.697729  0.125802  0.772415  0.133889

[334 rows x 5 columns]

In [27]:
newdf.head()

          0         1         2         3         4
0  0.876651  0.023991  0.870858  0.883872  0.537615
1  0.038192  0.757935  0.972538  0.908219  0.103995
2  0.844320  0.977541  0.313910  0.260622  0.055719
3  0.031624  0.788292  0.867700  0.934255  0.188155
4  0.392869  0.915014  0.249113  0.094444  0.489834

In [28]:
type(newdf)

pandas.core.frame.DataFrame

In [29]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.488399    0.535780    0.506221    0.540990    0.496745
std      0.286332    0.301830    0.292790    0.287117    0.304415
min      0.009779    0.001208    0.007075    0.002967    0.000157
25%      0.236475    0.269179    0.245450    0.330501    0.221020
50%      0.481156    0.572167    0.505163    0.521817    0.496705
75%      0.739719    0.813043    0.775032    0.793461    0.801382
max      0.995781    0.995699    0.997774    0.995839    0.997505

In [30]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [31]:
newdf[0][0] = "Anubhav"

In [32]:
newdf.head()

           0         1         2         3         4
0    Anubhav  0.023991  0.870858  0.883872  0.537615
1  0.0381923  0.757935  0.972538  0.908219  0.103995
2    0.84432  0.977541  0.313910  0.260622  0.055719
3  0.0316242  0.788292  0.867700  0.934255  0.188155
4   0.392869  0.915014  0.249113  0.094444  0.489834

In [33]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [34]:
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [35]:
ser.index

RangeIndex(start=0, stop=34, step=1)

In [36]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [37]:
ser.columns

AttributeError: 'Series' object has no attribute 'columns'

In [38]:
newdf.to_numpy()

array([['Anubhav', 0.023991491506664686, 0.8708578498044607,
        0.8838716779510424, 0.5376146331083508],
       [0.0381922891692833, 0.7579352725647732, 0.972537535503665,
        0.9082191098120659, 0.10399488272393398],
       [0.8443199122282291, 0.977540505846587, 0.3139095351668737,
        0.2606222092105277, 0.05571922182782352],
       ...,
       [0.029285230416051022, 0.8080055392577259, 0.4960615878303013,
        0.9681569885415902, 0.8543015644462512],
       [0.7537569079043372, 0.5650367055526092, 0.14804384330132692,
        0.33364927074104733, 0.9871406948987818],
       [0.9725230016401822, 0.6977293671926301, 0.12580151815703122,
        0.7724151679001703, 0.13388885004946594]], dtype=object)

In [39]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,Anubhav,0.0381923,0.84432,0.0316242,0.392869,0.900018,0.102834,0.31475,0.505492,0.30803,...,0.891036,0.0763442,0.639471,0.866985,0.307167,0.16858,0.581546,0.0292852,0.753757,0.972523
1,0.0239915,0.757935,0.977541,0.788292,0.915014,0.252664,0.326967,0.0840156,0.747042,0.48874,...,0.766218,0.458876,0.824853,0.958914,0.109172,0.828024,0.0447978,0.808006,0.565037,0.697729
2,0.870858,0.972538,0.31391,0.8677,0.249113,0.182738,0.67887,0.225204,0.379394,0.638989,...,0.362032,0.94933,0.932509,0.894189,0.0109147,0.146612,0.336545,0.496062,0.148044,0.125802
3,0.883872,0.908219,0.260622,0.934255,0.0944445,0.16977,0.469045,0.760342,0.345288,0.49659,...,0.461154,0.53436,0.667769,0.348703,0.351962,0.53941,0.332303,0.968157,0.333649,0.772415
4,0.537615,0.103995,0.0557192,0.188155,0.489834,0.504384,0.475048,0.87209,0.118729,0.0675136,...,0.74119,0.154484,0.887787,0.0729855,0.0156939,0.635924,0.411665,0.854302,0.987141,0.133889

In [40]:
newdf.head()

           0         1         2         3         4
0    Anubhav  0.023991  0.870858  0.883872  0.537615
1  0.0381923  0.757935  0.972538  0.908219  0.103995
2    0.84432  0.977541  0.313910  0.260622  0.055719
3  0.0316242  0.788292  0.867700  0.934255  0.188155
4   0.392869  0.915014  0.249113  0.094444  0.489834

In [41]:
newdf.sort_index(axis=0, ascending = False)

             0         1         2         3         4
333   0.972523  0.697729  0.125802  0.772415  0.133889
332   0.753757  0.565037  0.148044  0.333649  0.987141
331  0.0292852  0.808006  0.496062  0.968157  0.854302
330   0.581546  0.044798  0.336545  0.332303  0.411665
329    0.16858  0.828024  0.146612  0.539410  0.635924
..         ...       ...       ...       ...       ...
4     0.392869  0.915014  0.249113  0.094444  0.489834
3    0.0316242  0.788292  0.867700  0.934255  0.188155
2      0.84432  0.977541  0.313910  0.260622  0.055719
1    0.0381923  0.757935  0.972538  0.908219  0.103995
0      Anubhav  0.023991  0.870858  0.883872  0.537615

[334 rows x 5 columns]

In [42]:
newdf.sort_index(axis= 1, ascending = False)

            4         3         2         1          0
0    0.537615  0.883872  0.870858  0.023991    Anubhav
1    0.103995  0.908219  0.972538  0.757935  0.0381923
2    0.055719  0.260622  0.313910  0.977541    0.84432
3    0.188155  0.934255  0.867700  0.788292  0.0316242
4    0.489834  0.094444  0.249113  0.915014   0.392869
..        ...       ...       ...       ...        ...
329  0.635924  0.539410  0.146612  0.828024    0.16858
330  0.411665  0.332303  0.336545  0.044798   0.581546
331  0.854302  0.968157  0.496062  0.808006  0.0292852
332  0.987141  0.333649  0.148044  0.565037   0.753757
333  0.133889  0.772415  0.125802  0.697729   0.972523

[334 rows x 5 columns]

In [43]:
newdf[0]

0        Anubhav
1      0.0381923
2        0.84432
3      0.0316242
4       0.392869
         ...
329      0.16858
330     0.581546
331    0.0292852
332     0.753757
333     0.972523
Name: 0, Length: 334, dtype: object

In [44]:
type(newdf[0])

pandas.core.series.Series

> View

In [45]:
newdf2 = newdf

In [46]:
newdf2[0][0] = 'Anubhav Madhav'

c:\users\anubhav\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [47]:
newdf

                  0         1         2         3         4
0    Anubhav Madhav  0.023991  0.870858  0.883872  0.537615
1         0.0381923  0.757935  0.972538  0.908219  0.103995
2           0.84432  0.977541  0.313910  0.260622  0.055719
3         0.0316242  0.788292  0.867700  0.934255  0.188155
4          0.392869  0.915014  0.249113  0.094444  0.489834
..              ...       ...       ...       ...       ...
329         0.16858  0.828024  0.146612  0.539410  0.635924
330        0.581546  0.044798  0.336545  0.332303  0.411665
331       0.0292852  0.808006  0.496062  0.968157  0.854302
332        0.753757  0.565037  0.148044  0.333649  0.987141
333        0.972523  0.697729  0.125802  0.772415  0.133889

[334 rows x 5 columns]

> Copy

In [48]:
newdf2 = newdf.copy()

> or

In [49]:
newdf2 = newdf[:]

> Method to set/assign/change values

* loc

In [50]:
newdf.loc[0,0] = 25

In [51]:
newdf.head()

           0         1         2         3         4
0         25  0.023991  0.870858  0.883872  0.537615
1  0.0381923  0.757935  0.972538  0.908219  0.103995
2    0.84432  0.977541  0.313910  0.260622  0.055719
3  0.0316242  0.788292  0.867700  0.934255  0.188155
4   0.392869  0.915014  0.249113  0.094444  0.489834

> Change names of columns to strings

In [52]:
newdf.columns = list("ABCDE")

In [53]:
newdf.head()

           A         B         C         D         E
0         25  0.023991  0.870858  0.883872  0.537615
1  0.0381923  0.757935  0.972538  0.908219  0.103995
2    0.84432  0.977541  0.313910  0.260622  0.055719
3  0.0316242  0.788292  0.867700  0.934255  0.188155
4   0.392869  0.915014  0.249113  0.094444  0.489834

In [54]:
newdf.loc[0,0] = 16

In [55]:
newdf.head()

           A         B         C         D         E     0
0         25  0.023991  0.870858  0.883872  0.537615  16.0
1  0.0381923  0.757935  0.972538  0.908219  0.103995   NaN
2    0.84432  0.977541  0.313910  0.260622  0.055719   NaN
3  0.0316242  0.788292  0.867700  0.934255  0.188155   NaN
4   0.392869  0.915014  0.249113  0.094444  0.489834   NaN

In [56]:
newdf.loc[0,'A'] = 16

In [57]:
newdf.head()

           A         B         C         D         E     0
0         16  0.023991  0.870858  0.883872  0.537615  16.0
1  0.0381923  0.757935  0.972538  0.908219  0.103995   NaN
2    0.84432  0.977541  0.313910  0.260622  0.055719   NaN
3  0.0316242  0.788292  0.867700  0.934255  0.188155   NaN
4   0.392869  0.915014  0.249113  0.094444  0.489834   NaN

In [58]:
newdf.drop(0,axis=1)

             A         B         C         D         E
0           16  0.023991  0.870858  0.883872  0.537615
1    0.0381923  0.757935  0.972538  0.908219  0.103995
2      0.84432  0.977541  0.313910  0.260622  0.055719
3    0.0316242  0.788292  0.867700  0.934255  0.188155
4     0.392869  0.915014  0.249113  0.094444  0.489834
..         ...       ...       ...       ...       ...
329    0.16858  0.828024  0.146612  0.539410  0.635924
330   0.581546  0.044798  0.336545  0.332303  0.411665
331  0.0292852  0.808006  0.496062  0.968157  0.854302
332   0.753757  0.565037  0.148044  0.333649  0.987141
333   0.972523  0.697729  0.125802  0.772415  0.133889

[334 rows x 5 columns]

In [59]:
newdf.head()

           A         B         C         D         E     0
0         16  0.023991  0.870858  0.883872  0.537615  16.0
1  0.0381923  0.757935  0.972538  0.908219  0.103995   NaN
2    0.84432  0.977541  0.313910  0.260622  0.055719   NaN
3  0.0316242  0.788292  0.867700  0.934255  0.188155   NaN
4   0.392869  0.915014  0.249113  0.094444  0.489834   NaN

> To get a part of table

In [60]:
newdf.loc[[1,2],['C','D']]

          C         D
1  0.972538  0.908219
2  0.313910  0.260622

> To get all rows with particular columns

In [61]:
newdf.loc[:,['C','D']]

            C         D
0    0.870858  0.883872
1    0.972538  0.908219
2    0.313910  0.260622
3    0.867700  0.934255
4    0.249113  0.094444
..        ...       ...
329  0.146612  0.539410
330  0.336545  0.332303
331  0.496062  0.968157
332  0.148044  0.333649
333  0.125802  0.772415

[334 rows x 2 columns]

> TO get all columns with particular rows

In [62]:
newdf.loc[[1,2],:]

           A         B         C         D         E   0
1  0.0381923  0.757935  0.972538  0.908219  0.103995 NaN
2    0.84432  0.977541  0.313910  0.260622  0.055719 NaN

In [63]:
newdf = newdf.drop(0,axis=1)

In [64]:
newdf.head()

           A         B         C         D         E
0         16  0.023991  0.870858  0.883872  0.537615
1  0.0381923  0.757935  0.972538  0.908219  0.103995
2    0.84432  0.977541  0.313910  0.260622  0.055719
3  0.0316242  0.788292  0.867700  0.934255  0.188155
4   0.392869  0.915014  0.249113  0.094444  0.489834

In [65]:
newdf.loc[(newdf['A']<0.3)]

             A         B         C         D         E
1    0.0381923  0.757935  0.972538  0.908219  0.103995
3    0.0316242  0.788292  0.867700  0.934255  0.188155
6     0.102834  0.326967  0.678870  0.469045  0.475048
28    0.238565  0.010910  0.322987  0.931603  0.392349
32   0.0831271  0.488501  0.812589  0.608287  0.090950
..         ...       ...       ...       ...       ...
320    0.20477  0.995699  0.073399  0.688717  0.522948
322   0.199416  0.574648  0.182867  0.930128  0.862668
325  0.0763442  0.458876  0.949330  0.534360  0.154484
329    0.16858  0.828024  0.146612  0.539410  0.635924
331  0.0292852  0.808006  0.496062  0.968157  0.854302

[106 rows x 5 columns]

In [66]:
newdf.loc[(newdf['A']<0.3) and (newdf['C']>0.1)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [67]:
newdf.loc[(newdf['A']<0.3) & (newdf['C']>0.1)]

             A         B         C         D         E
1    0.0381923  0.757935  0.972538  0.908219  0.103995
3    0.0316242  0.788292  0.867700  0.934255  0.188155
6     0.102834  0.326967  0.678870  0.469045  0.475048
28    0.238565  0.010910  0.322987  0.931603  0.392349
32   0.0831271  0.488501  0.812589  0.608287  0.090950
..         ...       ...       ...       ...       ...
319   0.157113  0.687872  0.333858  0.899112  0.244907
322   0.199416  0.574648  0.182867  0.930128  0.862668
325  0.0763442  0.458876  0.949330  0.534360  0.154484
329    0.16858  0.828024  0.146612  0.539410  0.635924
331  0.0292852  0.808006  0.496062  0.968157  0.854302

[97 rows x 5 columns]

* iloc

In [68]:
newdf.head()

           A         B         C         D         E
0         16  0.023991  0.870858  0.883872  0.537615
1  0.0381923  0.757935  0.972538  0.908219  0.103995
2    0.84432  0.977541  0.313910  0.260622  0.055719
3  0.0316242  0.788292  0.867700  0.934255  0.188155
4   0.392869  0.915014  0.249113  0.094444  0.489834

In [69]:
newdf.iloc[0,4]

0.5376146331083508

In [70]:
newdf.iloc[[0,1],[1,2]]

          B         C
0  0.023991  0.870858
1  0.757935  0.972538

In [71]:
newdf.drop[0]

TypeError: 'method' object is not subscriptable

In [72]:
newdf.drop([0])

             A         B         C         D         E
1    0.0381923  0.757935  0.972538  0.908219  0.103995
2      0.84432  0.977541  0.313910  0.260622  0.055719
3    0.0316242  0.788292  0.867700  0.934255  0.188155
4     0.392869  0.915014  0.249113  0.094444  0.489834
5     0.900018  0.252664  0.182738  0.169770  0.504384
..         ...       ...       ...       ...       ...
329    0.16858  0.828024  0.146612  0.539410  0.635924
330   0.581546  0.044798  0.336545  0.332303  0.411665
331  0.0292852  0.808006  0.496062  0.968157  0.854302
332   0.753757  0.565037  0.148044  0.333649  0.987141
333   0.972523  0.697729  0.125802  0.772415  0.133889

[333 rows x 5 columns]

In [73]:
newdf.drop(['A'], axis=1)

            B         C         D         E
0    0.023991  0.870858  0.883872  0.537615
1    0.757935  0.972538  0.908219  0.103995
2    0.977541  0.313910  0.260622  0.055719
3    0.788292  0.867700  0.934255  0.188155
4    0.915014  0.249113  0.094444  0.489834
..        ...       ...       ...       ...
329  0.828024  0.146612  0.539410  0.635924
330  0.044798  0.336545  0.332303  0.411665
331  0.808006  0.496062  0.968157  0.854302
332  0.565037  0.148044  0.333649  0.987141
333  0.697729  0.125802  0.772415  0.133889

[334 rows x 4 columns]

In [74]:
newdf.head()

           A         B         C         D         E
0         16  0.023991  0.870858  0.883872  0.537615
1  0.0381923  0.757935  0.972538  0.908219  0.103995
2    0.84432  0.977541  0.313910  0.260622  0.055719
3  0.0316242  0.788292  0.867700  0.934255  0.188155
4   0.392869  0.915014  0.249113  0.094444  0.489834

In [75]:
newdf.drop(['A','D'], axis = 1, inplace = True)

In [76]:
newdf.head()

          B         C         E
0  0.023991  0.870858  0.537615
1  0.757935  0.972538  0.103995
2  0.977541  0.313910  0.055719
3  0.788292  0.867700  0.188155
4  0.915014  0.249113  0.489834

> Let's drop few rows

In [77]:
newdf.drop([0,13,22,3,5,6,87,23])

            B         C         E
1    0.757935  0.972538  0.103995
2    0.977541  0.313910  0.055719
4    0.915014  0.249113  0.489834
7    0.084016  0.225204  0.872090
8    0.747042  0.379394  0.118729
..        ...       ...       ...
329  0.828024  0.146612  0.635924
330  0.044798  0.336545  0.411665
331  0.808006  0.496062  0.854302
332  0.565037  0.148044  0.987141
333  0.697729  0.125802  0.133889

[326 rows x 3 columns]

> Now changes are not stored yet

In [78]:
newdf.head()

          B         C         E
0  0.023991  0.870858  0.537615
1  0.757935  0.972538  0.103995
2  0.977541  0.313910  0.055719
3  0.788292  0.867700  0.188155
4  0.915014  0.249113  0.489834

In [79]:
newdf.drop([0,13,22,3,5,6,87,23], inplace = True)

In [80]:
newdf.head()

          B         C         E
1  0.757935  0.972538  0.103995
2  0.977541  0.313910  0.055719
4  0.915014  0.249113  0.489834
7  0.084016  0.225204  0.872090
8  0.747042  0.379394  0.118729

> Now, on using 'inplace = True', changes are stored and saved

> Now, since many rows are dropped, indexing of dataframe is not continuous now.

> So, we want the index of remaining rows in continuity now.

In [81]:
newdf.reset_index()

     index         B         C         E
0        1  0.757935  0.972538  0.103995
1        2  0.977541  0.313910  0.055719
2        4  0.915014  0.249113  0.489834
3        7  0.084016  0.225204  0.872090
4        8  0.747042  0.379394  0.118729
..     ...       ...       ...       ...
321    329  0.828024  0.146612  0.635924
322    330  0.044798  0.336545  0.411665
323    331  0.808006  0.496062  0.854302
324    332  0.565037  0.148044  0.987141
325    333  0.697729  0.125802  0.133889

[326 rows x 4 columns]

> But, this added one more column named 'index', with the old values of indices

> To resolve that

In [82]:
newdf.reset_index(drop = True)

            B         C         E
0    0.757935  0.972538  0.103995
1    0.977541  0.313910  0.055719
2    0.915014  0.249113  0.489834
3    0.084016  0.225204  0.872090
4    0.747042  0.379394  0.118729
..        ...       ...       ...
321  0.828024  0.146612  0.635924
322  0.044798  0.336545  0.411665
323  0.808006  0.496062  0.854302
324  0.565037  0.148044  0.987141
325  0.697729  0.125802  0.133889

[326 rows x 3 columns]

> 'index' column with values of old indices is dropped now

In [83]:
newdf.head()

          B         C         E
1  0.757935  0.972538  0.103995
2  0.977541  0.313910  0.055719
4  0.915014  0.249113  0.489834
7  0.084016  0.225204  0.872090
8  0.747042  0.379394  0.118729

> But changes are not stored yet. Let's use 'inplace = True' to do that.

In [84]:
newdf.reset_index(drop = True, inplace = True)

In [85]:
newdf.head()

          B         C         E
0  0.757935  0.972538  0.103995
1  0.977541  0.313910  0.055719
2  0.915014  0.249113  0.489834
3  0.084016  0.225204  0.872090
4  0.747042  0.379394  0.118729

> Let's try renaming the columns now

In [86]:
newdf.columns = list("ABC")

In [87]:
newdf.head()

          A         B         C
0  0.757935  0.972538  0.103995
1  0.977541  0.313910  0.055719
2  0.915014  0.249113  0.489834
3  0.084016  0.225204  0.872090
4  0.747042  0.379394  0.118729

> Yipee!! Names of columns are changed.

In [88]:
newdf['B'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
321    False
322    False
323    False
324    False
325    False
Name: B, Length: 326, dtype: bool

In [89]:
newdf['B'].isnull().head()

0    False
1    False
2    False
3    False
4    False
Name: B, dtype: bool

> Let's change complete 'B' column to 'None' values

In [90]:
newdf['B'] = None

In [91]:
newdf.head()

          A     B         C
0  0.757935  None  0.103995
1  0.977541  None  0.055719
2  0.915014  None  0.489834
3  0.084016  None  0.872090
4  0.747042  None  0.118729

In [92]:
newdf['B'].isnull()

0      True
1      True
2      True
3      True
4      True
       ...
321    True
322    True
323    True
324    True
325    True
Name: B, Length: 326, dtype: bool

In [93]:
newdf.isnull()

         A     B      C
0    False  True  False
1    False  True  False
2    False  True  False
3    False  True  False
4    False  True  False
..     ...   ...    ...
321  False  True  False
322  False  True  False
323  False  True  False
324  False  True  False
325  False  True  False

[326 rows x 3 columns]

In [94]:
newdf.isnull().head()

       A     B      C
0  False  True  False
1  False  True  False
2  False  True  False
3  False  True  False
4  False  True  False

> Let's make a new dataframe to study 'dropna()' and 'drop_duplicates()'

In [95]:
dF = pd.DataFrame({
    "name": ['Anubhav', 'Digant', 'Deep'],
    "toys": ['Mjolnir', 'Shield', np.nan],
    "born": [pd.Timestamp("2000-01-20"), pd.NaT, pd.NaT]
})

In [96]:
dF

      name     toys       born
0  Anubhav  Mjolnir 2000-01-20
1   Digant   Shield        NaT
2     Deep      NaN        NaT

> Let's drop rows with 'any' null values (default = any)

In [97]:
dF.dropna()

      name     toys       born
0  Anubhav  Mjolnir 2000-01-20

> Let's drop only rows which have 'all' null values (how = 'all')

In [98]:
dF.dropna(how='all')

      name     toys       born
0  Anubhav  Mjolnir 2000-01-20
1   Digant   Shield        NaT
2     Deep      NaN        NaT

> No row is dropped, because in our DataFrame, each row has atleast 1 value (i.e. no row has all values as null)

> Let's put complete 'toy' column to null, and then we want to drop all those columns whose all values are null

In [99]:
dF['toys'] = None

In [100]:
dF

      name  toys       born
0  Anubhav  None 2000-01-20
1   Digant  None        NaT
2     Deep  None        NaT

In [101]:
dF.dropna(how = 'all', axis =1)

      name       born
0  Anubhav 2000-01-20
1   Digant        NaT
2     Deep        NaT

In [102]:
dF

      name  toys       born
0  Anubhav  None 2000-01-20
1   Digant  None        NaT
2     Deep  None        NaT

> Let's store the changes too

In [103]:
dF.dropna(how = 'all', axis =1, inplace = True)

In [104]:
dF

      name       born
0  Anubhav 2000-01-20
1   Digant        NaT
2     Deep        NaT

* drop_duplicates()

> Let's change our DataFrame a bit by creating some duplicates and adding back the column of "toys"

In [105]:
dF = pd.DataFrame({
    "name": ['Anubhav', 'Digant', 'Anubhav'],
    "toys": ['Mjolnir', 'Shield', np.nan],
    "born": [pd.Timestamp("2000-01-20"), pd.NaT, pd.NaT]
})

In [106]:
dF

      name     toys       born
0  Anubhav  Mjolnir 2000-01-20
1   Digant   Shield        NaT
2  Anubhav      NaN        NaT

> So, there is a duplicate of 'Anubhav'

> Let's drop duplicates from the DataFrame

In [107]:
dF.drop_duplicates()

      name     toys       born
0  Anubhav  Mjolnir 2000-01-20
1   Digant   Shield        NaT
2  Anubhav      NaN        NaT

> See, nothing is changed

In [108]:
dF.drop_duplicates(axis=1)

TypeError: drop_duplicates() got an unexpected keyword argument 'axis'

> Error!! Because 'drop_duplicates()' do not takes 'axis' as a parameter

> To fix this

In [109]:
dF.drop_duplicates(subset = ['name'])

      name     toys       born
0  Anubhav  Mjolnir 2000-01-20
1   Digant   Shield        NaT

> default: keep = 'first'

> Suppose, if we want the 'first' duplicate to be dropped and we want the 'last' duplicate to be safe

In [110]:
dF.drop_duplicates(subset = ['name'], keep='last')

      name    toys born
1   Digant  Shield  NaT
2  Anubhav     NaN  NaT

> See, now we have our last duplicate, whereas 'first' duplicate has been dropped

> Suppose, if we want to remove both the duplicates, i.e. remove all those values which are repeated

In [111]:
dF.drop_duplicates(subset = ['name'], keep=False)

     name    toys born
1  Digant  Shield  NaT

> See, now both the duplicates are dropped

> Let us see, now what happens if we have more than 2 duplicates.
> Let's edit our DataFrame for that

In [112]:
dF = pd.DataFrame({
    "name": ['Anubhav', 'Digant', 'Anubhav', 'Deep', 'Anubhav'],
    "toys": ['Mjolnir', 'Shield', np.nan, np.nan, np.nan],
    "born": [pd.Timestamp("2000-01-20"), pd.NaT, pd.NaT, pd.NaT, pd.NaT]
})

> Now, we have 3 'Anubhav'. Let's see, what happens on dropping duplicates.

In [113]:
dF.drop_duplicates()

      name     toys       born
0  Anubhav  Mjolnir 2000-01-20
1   Digant   Shield        NaT
2  Anubhav      NaN        NaT
3     Deep      NaN        NaT

> Nothing changed

In [114]:
dF.drop_duplicates(subset='name')

      name     toys       born
0  Anubhav  Mjolnir 2000-01-20
1   Digant   Shield        NaT
3     Deep      NaN        NaT

> See, this only kept the first 'Anubhav' and dropped all the duplicates after that

> Let's try: keep = 'last'

In [115]:
dF.drop_duplicates(subset='name', keep='last')

      name    toys born
1   Digant  Shield  NaT
3     Deep     NaN  NaT
4  Anubhav     NaN  NaT

> See, this kept only our 'last' Anubhav, whereas removed rest of the duplicates.

** Doubt: How can we make it to drop the 'middle' duplicate, and keep both 'first' and 'last'. **

> Let's remove all the duplicates.

In [116]:
dF.drop_duplicates(subset = 'name', keep = False)

     name    toys born
1  Digant  Shield  NaT
3    Deep     NaN  NaT

> See, now all the 'duplicates' are removed.

In [117]:
dF.shape

(5, 3)

In [118]:
dF

      name     toys       born
0  Anubhav  Mjolnir 2000-01-20
1   Digant   Shield        NaT
2  Anubhav      NaN        NaT
3     Deep      NaN        NaT
4  Anubhav      NaN        NaT

> 3 'Anubhav's are not dropped yet because we didn't stored the changes using 'inplace = True'. Let's not drop 'Anubhav', cause it's me. LoL!!

In [119]:
dF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   toys    2 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 248.0+ bytes

In [120]:
dF['name'].value_counts(dropna = False)

Anubhav    3
Deep       1
Digant     1
Name: name, dtype: int64

> This told us the count of occurrence of each value in the column 'name'.

In [121]:
dF['name'].value_counts(dropna = True)

Anubhav    3
Deep       1
Digant     1
Name: name, dtype: int64

In [122]:
dF['toys'].value_counts(dropna = True)

Shield     1
Mjolnir    1
Name: toys, dtype: int64

In [123]:
dF['toys'].value_counts(dropna = False)

NaN        3
Shield     1
Mjolnir    1
Name: toys, dtype: int64

In [124]:
dF.notnull()

   name   toys   born
0  True   True   True
1  True   True  False
2  True  False  False
3  True  False  False
4  True  False  False

> notnull() is opposite of isnull()

In [125]:
dF.isnull()

    name   toys   born
0  False  False  False
1  False  False   True
2  False   True   True
3  False   True   True
4  False   True   True

* Let's create a DataFrame which contains only integers with 3 rows and 2 columns. Then perform some DataFrame methods over it. *

In [126]:
df2 = pd.DataFrame(np.random.randint(0,100,size=(3,2)))

In [127]:
df2

    0   1
0  51  43
1  24  75
2  14  96

In [128]:
df2.describe()

               0          1
count   3.000000   3.000000
mean   29.666667  71.333333
std    19.139836  26.689573
min    14.000000  43.000000
25%    19.000000  59.000000
50%    24.000000  75.000000
75%    37.500000  85.500000
max    51.000000  96.000000

In [129]:
df2.mean()

0    29.666667
1    71.333333
dtype: float64

In [130]:
df2.mean(axis = 0)

0    29.666667
1    71.333333
dtype: float64

In [131]:
df2.mean(axis = 1)

0    47.0
1    49.5
2    55.0
dtype: float64

In [132]:
df2.corr()

          0         1
0  1.000000 -0.990211
1 -0.990211  1.000000

In [133]:
df2.count()

0    3
1    3
dtype: int64

In [134]:
df2.max()

0    51
1    96
dtype: int32

In [135]:
df2.min()

0    14
1    43
dtype: int32

In [136]:
df2.median()

0    24.0
1    75.0
dtype: float64

In [137]:
df2.std()

0    19.139836
1    26.689573
dtype: float64

*** Handling MS Excel sheets using Pandas ***

> First, create a MS Excel Sheet in the current directory, where this jupyter notebook is running.

> create 2 sheets within 'data.xlsx', namely 'Sheet1' and 'Sheet2'

In [138]:
pd.read_excel('data.xlsx')

   Unnamed: 0          NameS2 BranchS2  Roll NoS2
0           0  Anubhav Madhav      CSE  201851024
1           1          Digant      Com  201851025
2           2           Deep       CSE  201851037

> Error!! Because to make pandas read an excel file, we need to install 'xlrd', as shown in the error message.

> For that: `pip install xlrd`

> After installing 'xlrd', again read the excel file.

In [139]:
pd.read_excel('data.xlsx')

   Unnamed: 0          NameS2 BranchS2  Roll NoS2
0           0  Anubhav Madhav      CSE  201851024
1           1          Digant      Com  201851025
2           2           Deep       CSE  201851037

> See, after installing 'xlrd', pandas read the excel file too, not just a CSV file.

> But, it only read the 'Sheet1' of our excel sheet. What if we want it to read the 'Sheet2' of our excel sheet.

In [140]:
pd.read_excel('data.xlsx', sheet_name = "Sheet2")

   Unnamed: 0          NameS2 BranchS2  Roll NoS2
0           0  Anubhav Madhav      CSE  201851024
1           1          Digant      Com  201851025
2           2           Deep       CSE  201851037

In [141]:
data = pd.read_excel('data.xlsx', sheet_name = "Sheet2")

> See, now it read the Sheet2 of our excel file.

> Let's change some value in the current sheet, i.e. Sheet2.

In [142]:
data

   Unnamed: 0          NameS2 BranchS2  Roll NoS2
0           0  Anubhav Madhav      CSE  201851024
1           1          Digant      Com  201851025
2           2           Deep       CSE  201851037

In [143]:
data.iloc[0,0] = "Anubhav Madhav"

> Let's write back the changes into the excel file, in current sheet, i.e. Sheet2.

In [144]:
data.to_excel("data.xlsx", sheet_name = 'Sheet2')

PermissionError: [Errno 13] Permission denied: 'data.xlsx'

> Error!! Because, to make pandas write back to our excel file, we need to install 'openpyxl'.

> For that: `pip install openpyxl`

> After installing 'openpyxl', again write back to excel file.

In [151]:
data.to_excel("data.xlsx", sheet_name = 'Sheet2')

> See, the changes in excel file now.

> But, this deleted the 'Sheet1'

> Let's try writing the same back to Sheet1

In [152]:
data.to_excel("data.xlsx", sheet_name = 'Sheet1')

> The same thing is copied in 'Sheet1', but now 'Sheet2' is deleted.

> To fix that:

In [147]:
data2 = data.copy()

In [148]:
data2

       Unnamed: 0          NameS2 BranchS2  Roll NoS2
0  Anubhav Madhav  Anubhav Madhav      CSE  201851024
1               1          Digant      Com  201851025
2               2           Deep       CSE  201851037

In [153]:
with pd.ExcelWriter('data.xlsx') as writer:
    data.to_excel(writer, sheet_name='Sheet1')
    data2.to_excel(writer, sheet_name='Sheet2')

> Now, check your excel file, here are 2 sheets now, named 'Sheet1' and 'Sheet2', with same contents in each.

** In this way, we can work with excel files using pandas. **

*** PANDAS Tutorial Completed ***